import random
# Створіть список випадкових чисел із випадковою кількістю елементів від 3 до 10.
#
# Ваше завдання - створити новий список з 3 елементів початкового списку - першим, третім і другим з кінця.


# Генерация случайного количества элементов от 3 до 10
NUMS_SIZE = random.randint(3, 10)
numbers = []
test = "test"

#  Заполняем список случайными числами
for i in range(NUMS_SIZE):
    numbers.append(random.randint(1, 10))

#  Создаем новый список согласно требованиям
total_result = [numbers[0], numbers[2], numbers[-2]]

#  Выводим результаты
print("Случайный список ", numbers)
print("Новый список с 1м, 3м и 2м с конца ",total_result)






