# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!

# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

numbers = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]

result = []
value_for_zero = 0

# Проходимся по всем элементам в списке
for i in numbers:
    if i != 0:
        # Добавляем ненулевые элементы в новый список result
        result.append(i)
    elif i == 0:
        # Подсчитываем количество нулей
        value_for_zero = value_for_zero + 1

# Добавляем в конец списка столько нулей, сколько их было. Если умножать на список, то это будет не умножение, а повторение  списка указанное число раз
result.extend([0] * value_for_zero)

print(result)


