# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд], потім перемножити
# цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.


numbers = []
sum_of_even_index = 0
# Делаем проверку если массив пустой, то выводим 0
if len(numbers) == 0:
    print(numbers)
else:
    # Запускаем цикл по всей длинне массива
    for i in range(len(numbers)):
        # Содаем условие, чтобы определить четный индекс.
     if i % 2 == 0:
        # Записываем значения чисел, где индекс четный.
        sum_of_even_index = sum_of_even_index + numbers[i]
        # Умножаем полученную сумму на последнее значение с массива
    sum_of_even_index = sum_of_even_index * numbers[-1]
    print(sum_of_even_index)

