# Task2. На запит від програми, користувач вводить 5-ти значне ціле, позитивне число.
#Вам необхідно "перевернути" цє число задом наперед, тобто щоб у результаті вийшло теж 5-ти значне число,
#але із зворотною послідовністю цифр.


# Просим пользователя ввести пятизначное число
number = int(input("Enter 5-digits number "))

# Используем методы разделения и извлекаем цифры
digit1 = number // 10000
digit2 = (number // 1000) % 10
digit3 = (number // 100) % 10
digit4 = (number // 10) % 10
digit5 = number % 10

# Переворачиваем числа
print(digit5 * 10000 + digit4 * 1000 + digit3 * 100 + digit2 * 10 + digit1)