# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури,
# після чого друкує на екрані стовпчик цифр, з якого це число складається.
# Наприклад, користувач вводить 1234, а програма виводить:
#1
#2
#3
#4
#Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod).
#Виведення в стовпчик можна зробити за допомогою 4-х функцій print.


# Просим пользователя ввести четырёхзначное число
number = int(input("Enter 4-digits number "))

# Используем методы разделения
digit1 = number // 1000
digit2 = (number // 100) % 10
digit3 = (number // 10) % 10
digit4 = number % 10

# Печатаем все цифры через print, каждая цифра отдельно
print(digit1)
print(digit2)
print(digit3)
print(digit4)