# Ваша програма має перенести останній елемент списку з кінця на початок, тобто,
# останній елемент списку має стати першим. Послідовність інших елементів не має змінюватися.
# Порожній список або список з одним елементом повинен залишитися незмінним.
# Кількість елементів у списку може бути будь-яким – нуль та більше!

# Приклади:
# [12, 3, 4, 10] => [10, 12, 3, 4]
# [1] => [1]
# [] => []
# [12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]



numbers = [12, 3, 4, 10, 8]

if numbers:  # Проверяем, если будет True(значения есть в массиве), то условие внутри if должно выполниться
    # Методом insert всталяем последнее значение в начало
    numbers.insert(0, numbers[-1])
    # Метод pop без указания индекса, удаляет последний елемент из массива
    numbers.pop()

print(numbers)